"use client"

// import { motion } from "framer-motion"
import BackButton from "@/app/_ui/back-button"

const differences = [
  {
    title: "منابع آموزشی بومی و حقوق ایران",
    description: `مدل های عمومی هوش مصنوعی مانند چت جی پی تی بر اساس داده‌های عمومی جهانی آموزش دیده اند و برای تولید پاسخ، بر میزان ارتباط بین سوال و پاسخ تمرکز کرده و منابع تولید پاسخ دارای اهمیت یکسانی هستند.
اما دادنوس بر پایه قوانین، مقررات، لوایح، آرای وحدت رویه و نظریات مشورتی کشور آموزش دیده و برای تولید پاسخ سوالات حقوقی، صرفا بر منابع ذکر شده در فوق تکیه دارد.`
  },
  {
    title: "تخصص در حوزه حقوق",
    description: `چت‌جی‌پی‌تی یک مدل عمومی است، در حالی که دادنوس یک دستیار تخصصی حقوقی است که برای وکلا، مشاوران و مدیران کسب‌وکار طراحی شده و بر تولید متون دقیق و منطبق با رویه قضایی کشور تمرکز دارد.`
  },
  {
    title: "تحلیل و تدوین اسناد حقوقی ایرانی",
    description: `دادنوس تحلیل و تهیه پیش نویس اسناد حقوقی را بر اساس استانداردهای حقوقی داخلی انجام می دهد در حالیکه مدل های هوش مصنوعی عمومی مانند چت جی پی تی برای انجام کار مشابه از داده های عمومی جهانی استفاده می کنند که می تواند با استانداردهای داخلی کشور متفاوت باشند.`
  },
  {
    title: "کاهش میزان توهم (Hallucination)",
    description: `دادنوس با تکیه بر منابع معتبر حقوقی فارسی، از جمله قوانین، آیین‌نامه‌ها و آرای وحدت رویه، پاسخ‌ها را بر پایه داده‌های واقعی تولید می‌کند. این رویکرد باعث می‌شود میزان خطا و «توهم» در پاسخ‌ها به‌مراتب کمتر از مدل‌های عمومی مانند ChatGPT باشد.`
  },
  {
    title: "پرسش و پاسخ با ذکر منبع معتبر",
    description: `با توجه به اینکه دادنوس با قوانین و مقررات جامع کشور آموزش دیده است، می توان ادعا کرد منابع اعلامی همواره صحیح می باشند در صورتی که ذکر منابع توسط چت‌جی‌پی‌تی می تواند به استناد نظرات افراد و وبلاگ های غیر تخصصی باشد و نیازمند بررسی دقیق تمام منابع ذکر شده می باشد.`
  },
]

export default function DananousVsChatGPT() {
  return (
    <div className="max-w-3xl mx-auto px-4 py-16">
      <div className="fixed top-3 left-1 md:top-20 md:left-20 pt-safe">
        <BackButton />
      </div>

      <h1 className="text-3xl md:text-5xl font-black mb-20 mt-10 text-center pt-safe">
        🧠 تفاوت دادنوس با ChatGPT
      </h1>

      <div className="space-y-8">
        {/* {differences.map((item, idx) => (
          <motion.div
            key={idx}
            initial={{ opacity: 0, x: 50 }}
            whileInView={{ opacity: 1, x: 0 }}
            viewport={{ once: true, amount: 'some' }}
            transition={{ duration: 0.5, delay: idx * 0.1 }}
            className="flex gap-10 items-start"
          >
            <div>
              <h2 className="text-lg font-semibold mb-2">{idx + 1}. {item.title}</h2>
              <p className="text-sm leading-relaxed whitespace-pre-line">
                {item.description}
              </p>
            </div>
          </motion.div>
        ))} */}
        {differences.map((item, idx) => (
          <div
            key={idx}
            className="flex gap-10 items-start"
          >
            <div>
              <h2 className="text-lg font-semibold mb-2">{idx + 1}. {item.title}</h2>
              <p className="text-sm leading-relaxed whitespace-pre-line">
                {item.description}
              </p>
            </div>
          </div>
        ))}
      </div>
    </div>
  )
}
